# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

In [1]:
import pandas as pd

### Step 2. Import the dataset from the file given in the repo US_Baby_Names_right.csv

In [4]:
pd.read_csv('./US_Baby_Names_right.csv')

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [2]:
pd.read_csv('./US_Baby_Names_right.csv')

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv('./US_Baby_Names_right.csv')

In [5]:
baby_names = pd.read_csv("./US_Baby_Names_right.csv")

### Step 4. See the first 10 entries

In [6]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
baby_names.drop(columns=['Unnamed: 0', 'Id'])

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

In [29]:
baby_names.drop(columns=['Unnamed: 0', 'Id'])

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [7]:
baby_names.value_counts('Gender')

Gender
F    558846
M    457549
Name: count, dtype: int64

In [11]:
baby_names.value_counts('Gender')

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [10]:
names = baby_names.value_counts('Name')

names

Name
Riley       1112
Avery       1080
Jordan      1073
Peyton      1064
Hayden      1049
            ...
Allisa         1
Allianna       1
Alliah         1
Allia          1
Kaisei         1
Name: count, Length: 17632, dtype: int64

In [17]:
names = baby_names.value_counts('Name')

names

Name
Riley       1112
Avery       1080
Jordan      1073
Peyton      1064
Hayden      1049
            ...
Allisa         1
Allianna       1
Alliah         1
Allia          1
Kaisei         1
Name: count, Length: 17632, dtype: int64

### Step 8. How many different names exist in the dataset?

In [11]:
baby_names['Name'].nunique()

17632

In [30]:
baby_names.groupby('Name').count()

         Unnamed: 0   Id  Year  Gender  State  Count
Name
Aaban             2    2     2       2      2      2
Aadan             4    4     4       4      4      4
Aadarsh           1    1     1       1      1      1
Aaden           196  196   196     196    196    196
Aadhav            1    1     1       1      1      1
...             ...  ...   ...     ...    ...    ...
Zyra              7    7     7       7      7      7
Zyrah             2    2     2       2      2      2
Zyren             1    1     1       1      1      1
Zyria            10   10    10      10     10     10
Zyriah            9    9     9       9      9      9

[17632 rows x 6 columns]

In [22]:
baby_names.value_counts('Name').count()

np.int64(17632)

### Step 9. What is the name with most occurrences?

In [20]:
baby_names.value_counts('Name').head(1)

Name
Riley    1112
Name: count, dtype: int64

### Step 10. How many different names have the least occurrences?

In [24]:
filter = baby_names.value_counts('Name') == 1

filter[filter].count()

np.int64(3682)

In [38]:
lowest_nums = baby_names.value_counts('Name') == 1

lowest_nums[lowest_nums].count()

np.int64(3682)

### Step 11. What is the median name occurrence?

In [37]:
median_occurrence = baby_names['Count'].median()

median_name = baby_names[baby_names['Count'] == median_occurrence]

median_name[['Name', 'Count']]

                Name  Count
71           Makayla     11
72             Maria     11
73              Mary     11
74          Michelle     11
259        Alexandra     11
...              ...    ...
1016276  Christopher     11
1016277       Corbin     11
1016278        Gavin     11
1016279      Greyson     11
1016280       Isaiah     11

[36199 rows x 2 columns]

In [46]:
baby_names['Name']

0             Emma
1          Madison
2           Hannah
3            Grace
4            Emily
            ...
1016390       Seth
1016391    Spencer
1016392       Tyce
1016393     Victor
1016394     Waylon
Name: Name, Length: 1016395, dtype: object

### Step 12. What is the standard deviation of names?

In [38]:
baby_names['Count'].std()

np.float64(97.39734648617814)

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [40]:
baby_names.describe(include='all')

,Unnamed: 0,Id,Name,Year,Gender,State,Count
count,1.016395e+06,1.016395e+06,1016395,1.016395e+06,1016395,1016395,1.016395e+06
unique,NaN,NaN,17632,NaN,2,51,NaN
top,NaN,NaN,Riley,NaN,F,CA,NaN
freq,NaN,NaN,1112,NaN,558846,76781,NaN
mean,2.830990e+06,2.830991e+06,NaN,2.009053e+03,NaN,NaN,3.485012e+01
std,1.652476e+06,1.652476e+06,NaN,3.138293e+00,NaN,NaN,9.739735e+01
min,1.134900e+04,1.135000e+04,NaN,2.004000e+03,NaN,NaN,5.000000e+00
25%,1.317326e+06,1.317328e+06,NaN,2.006000e+03,NaN,NaN,7.000000e+00
50%,2.811920e+06,2.811921e+06,NaN,2.009000e+03,NaN,NaN,1.100000e+01
75%,4.242554e+06,4.242556e+06,NaN,2.012000e+03,NaN,NaN,2.600000e+01
max,5.647425e+06,5.647426e+06,NaN,2.014000e+03,NaN,NaN,4.167000e+03